review-service/profiling/load-test-review.yml
config:
  target: "http://localhost:5004"   
  phases:
    - duration: 30
      arrivalRate: 10

scenarios:
  - name: "Review service load test"
    flow:
      - post:
          url: "/api/reviews"
          headers:
            Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjY5Mjg0MDc3ZTU5Y2MzNzAzZjM5NjdhMiIsInVzZXJuYW1lIjoiYWRtaW54eCIsInJvbGUiOiJhZG1pbiIsImlhdCI6MTc2NDMzOTg1NywiZXhwIjoxNzY0NDI2MjU3fQ.OXEIldDHiQjQ9juPMJRMj2fXP6lu0K9gad-Ktf0xeg8"
          json:
            roomID: "CHEM 502"
            rating: 4
            comment: "Load test review"


      - get:
          url: "/api/reviews/myreviews"
          headers:
            Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjY5Mjg0MDc3ZTU5Y2MzNzAzZjM5NjdhMiIsInVzZXJuYW1lIjoiYWRtaW54eCIsInJvbGUiOiJhZG1pbiIsImlhdCI6MTc2NDMzOTg1NywiZXhwIjoxNzY0NDI2MjU3fQ.OXEIldDHiQjQ9juPMJRMj2fXP6lu0K9gad-Ktf0xeg8"


      - get:
          url: "/api/reviews/room/CHEM%20502"
          headers:
            Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjY5Mjg0MDc3ZTU5Y2MzNzAzZjM5NjdhMiIsInVzZXJuYW1lIjoiYWRtaW54eCIsInJvbGUiOiJhZG1pbiIsImlhdCI6MTc2NDMzOTg1NywiZXhwIjoxNzY0NDI2MjU3fQ.OXEIldDHiQjQ9juPMJRMj2fXP6lu0K9gad-Ktf0xeg8"


      - get:
          url: "/api/reviews/all"
          headers:
            Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjY5Mjg0MDc3ZTU5Y2MzNzAzZjM5NjdhMiIsInVzZXJuYW1lIjoiYWRtaW54eCIsInJvbGUiOiJhZG1pbiIsImlhdCI6MTc2NDMzOTg1NywiZXhwIjoxNzY0NDI2MjU3fQ.OXEIldDHiQjQ9juPMJRMj2fXP6lu0K9gad-Ktf0xeg8"